configuration/Catalogs/_Правила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Правила</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ОбработчикиПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьГруппыУсловий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРоли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаДополнение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сравнение_1</Name>
							<Type>
								<v8:Type>cfg:EnumRef._ВариантыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сравнение_2</Name>
							<Type>
								<v8:Type>cfg:EnumRef._ВариантыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие_ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/InformationRegisters/_СостояниеКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостояниеКарточек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_Элемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/_ВариантыСравнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_ВариантыСравнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/_ВидыКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_ВидыКарточек</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
								<v8:Type>cfg:EnumRef._СпособыХранениеРеквизитовКарточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаВХранении</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеДействие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФункциональнаяРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтображаемыеГруппыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппыКоманд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки_родители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Правила/Ext/ManagerModule.bsl
Функция ПолучитьДоступныеПравила(Отбор,МенеджерВременныхТаблиц=Неопределено) Экспорт
	// 1. Подготовка Менеджера Временных Таблиц
	Если Не ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	СформироватьМВТ_ДоступныеПравила(Отбор,МенеджерВременныхТаблиц);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Правило
		|ИЗ
		|	ВТ_ДоступныеПравила КАК ВТ_ДоступныеПравила";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Правило);
	КонецЦикла;
	
	Возврат Результат; 

КонецФункции

Функция ПолучитьДоступныеКоманды(Отбор,МенеджерВременныхТаблиц=Неопределено) Экспорт
	// 1. Подготовка Менеджера Временных Таблиц
	Если Не ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	СформироватьМВТ_ДоступныеПравила(Отбор,МенеджерВременныхТаблиц);

	//2.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппаКоманд КАК ГруппаКоманд,
		|	Команда КАК Команда
		|ИЗ
		|	ВТ_ДоступныеПравила КАК ВТ_ДоступныеПравила";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//3.
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив();
	Пока Выборка.Следующий() Цикл
		ЭлементВозврата = Новый Структура ("ГруппаКоманд,Команда", Выборка.ГруппаКоманд, Выборка.Команда);
		Результат.Добавить(ЭлементВозврата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Подготавливает менеджер временных таблиц с доступными правилами выполнения команд для карточек переданных в параметрах.
//
// Процедура не возвращает данные напрямую. Результатом является заполнение
// переданного МенеджераВременныхТаблиц служебными временными таблицами,
// основная из которых — ВТ_ДоступныеПравила.
//
// Параметры:
//  Отбор - Структура - правила отбора карточек, команд и видов карточек:
//   * Карточки - Массив из Структура - группы проверяемых карточек по функциональным ролям.
//     Каждая структура массива содержит:
//      - ФункциональнаяРоль - СправочникСсылка._ФункциональныеРоли - функциональная роль,
//        для которой проверяются карточки;
//      - Карточки - Массив из СправочникСсылка._Карточки - проверяемые карточки;
//      - ПроверятьКакИ - Булево - способ проверки карточек внутри функциональной роли:
//          Истина - должны быть выполнены проверки по всем карточкам роли;
//          Ложь   - достаточно выполнения проверки хотя бы по одной карточке роли.
//
//   * Команды - Массив из СправочникСсылка._Команды - необязательный - список команд,
//     для которых необходимо подобрать доступные правила.
//     Если параметр указан, то ВидКарточки может не передаваться.
//
//   * ВидКарточки - СправочникСсылка._ВидыКарточки - обязателен, если не указан параметр Команды.
//     Используется для поиска правил, если команды не заданы.
//
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//  в который будут помещены итоговые временные таблицы запроса.
//
// Результат:
//  Заполненный МенеджерВременныхТаблиц полученный в виде параметра.
//  Основная итоговая таблица:
//   * ВТ_ДоступныеПравила - содержит доступные правила и их команды:
//      - Правило       - СправочникСсылка._Правила;
//      - Команда       - СправочникСсылка._Команды;
//      - ГруппаКоманд  - СправочникСсылка._КомандыГруппы.
//
// прерывает работу при следующих исключениях:
//  - Неверная структура параметра Отбор;
//  - Не заполнен обязательный параметр Отбор.Карточки;
//  - В элементах Отбор.Карточки не заполнены обязательные свойства;
//  - Не указан ВидКарточки при отсутствии Команды;
//  - При отсутствии Команды в отборе передано больше одной функциональной роли;
//  - При отсутствии Команды единственная функциональная роль не является "ОсновнаяФР";
//  - Для указанных команд обнаружено противоречие пар "ФункциональнаяРоль - ВидКарточки";
//  - В указанных командах отсутствуют обязательные функциональные роли из Отбор.Карточки.
//
Процедура СформироватьМВТ_ДоступныеПравила(Отбор, МенеджерВременныхТаблиц) Экспорт
    
    // 1. Подготовка Менеджера Временных Таблиц
    //Если Не ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
    //    МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    //КонецЕсли;
    
    // 2. Проверка заполнения параметров
    Если Не ТипЗнч(Отбор) = Тип("Структура") Тогда
        ВызватьИсключение "Параметр ""Отбор"" должен быть структурой.";
    КонецЕсли;
    
    Если Не Отбор.Свойство("Карточки") ИЛИ ТипЗнч(Отбор.Карточки) <> Тип("Массив") ИЛИ Отбор.Карточки.Количество() = 0 Тогда
        ВызватьИсключение "Параметр ""Отбор"" должен содержать заполненный массив ""Карточки"".";
    КонецЕсли;
    
    // Проверка структуры элементов массива Карточки
    Для Каждого ЭлементОтбора Из Отбор.Карточки Цикл
        Если Не ТипЗнч(ЭлементОтбора) = Тип("Структура") Тогда
            ВызватьИсключение "Элементы массива ""Карточки"" должны быть структурами.";
        КонецЕсли;
        Если Не ЭлементОтбора.Свойство("ФункциональнаяРоль") ИЛИ Не ЗначениеЗаполнено(ЭлементОтбора.ФункциональнаяРоль) Тогда
            ВызватьИсключение "В элементе массива ""Карточки"" не заполнена ""ФункциональнаяРоль"".";
        КонецЕсли;
        Если Не ЭлементОтбора.Свойство("Карточки") ИЛИ ТипЗнч(ЭлементОтбора.Карточки) <> Тип("Массив") ИЛИ ЭлементОтбора.Карточки.Количество() = 0 Тогда
            ВызватьИсключение "В элементе массива ""Карточки"" не заполнен массив ссылок ""Карточки"".";
        КонецЕсли;
        Если Не ЭлементОтбора.Свойство("ПроверятьКакИ") ИЛИ ТипЗнч(ЭлементОтбора.ПроверятьКакИ) <> Тип("Булево") Тогда
            ВызватьИсключение "В элементе массива ""Карточки"" не заполнено свойство ""ПроверятьКакИ"".";
        КонецЕсли;
    КонецЦикла;
    
    ЕстьКоманды = Отбор.Свойство("Команды") И ТипЗнч(Отбор.Команды) = Тип("Массив") И Отбор.Команды.Количество() > 0;
    ЕстьВидКарточки = Отбор.Свойство("ВидКарточки") И ЗначениеЗаполнено(Отбор.ВидКарточки);
    
    Если ЕстьКоманды Тогда
        // Проверка Команд
        СоответствиеРолейВидамКарточек = Новый Соответствие;
        Для Каждого Команда Из Отбор.Команды Цикл
            Если ТипЗнч(Команда) <> Тип("СправочникСсылка._Команды") ИЛИ Не ЗначениеЗаполнено(Команда) Тогда
                ВызватьИсключение "В массиве ""Команды"" присутствуют некорректные ссылки.";
            КонецЕсли;
            
            ОбъектКоманды = Команда.ПолучитьОбъект();
            Если ОбъектКоманды = Неопределено Тогда
                ВызватьИсключение "Не удалось получить объект команды " + Команда;
            КонецЕсли;
            
            // Сбор ролей команды и проверка противоречий видов карточек для одной роли
            РолиКоманды = Новый Массив;
            Для Каждого СтрокаТЧ Из ОбъектКоманды.ФункциональныеРоли Цикл
                РолиКоманды.Добавить(СтрокаТЧ.ФункциональнаяРоль);
                
                ТекущийВК = СоответствиеРолейВидамКарточек[СтрокаТЧ.ФункциональнаяРоль];
                Если ТекущийВК = Неопределено Тогда
                    СоответствиеРолейВидамКарточек[СтрокаТЧ.ФункциональнаяРоль] = СтрокаТЧ.ВидКарточки;
                ИначеЕсли ТекущийВК <> СтрокаТЧ.ВидКарточки Тогда
                    ВызватьИсключение "Противоречие: для функциональной роли " + СтрокаТЧ.ФункциональнаяРоль + " указаны разные виды карточек в разных командах.";
                КонецЕсли;
            КонецЦикла;
            
            // Проверка наличия всех заявленных ФР в команде
            Для Каждого ГруппаФР Из Отбор.Карточки Цикл
                Если РолиКоманды.Найти(ГруппаФР.ФункциональнаяРоль) = Неопределено Тогда
                    ВызватьИсключение "В команде " + Команда + " отсутствует обязательная функциональная роль " + ГруппаФР.ФункциональнаяРоль;
                КонецЕсли;
            КонецЦикла;
        КонецЦикла;
        
    Иначе
        // Если команд нет, то должен быть указан ВидКарточки и одна ФР "ОсновнаяФР"
        Если Не ЕстьВидКарточки Тогда
            ВызватьИсключение "При отсутствии массива ""Команды"" обязательно должен быть указан ""ВидКарточки"".";
        КонецЕсли;
        
        Если Отбор.Карточки.Количество() = 1 Тогда
            ЕстьОсновнаяФР = Ложь;
            Попытка
                ОсновнаяФР = ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР");
                Если Отбор.Карточки[0].ФункциональнаяРоль = ОсновнаяФР Тогда
                    ЕстьОсновнаяФР = Истина;
                КонецЕсли;
            Исключение
                // Резервная проверка по коду/наименованию, если предопределенный элемент недоступен напрямую
                Если Отбор.Карточки[0].ФункциональнаяРоль.Код = "ОсновнаяФР" ИЛИ Отбор.Карточки[0].ФункциональнаяРоль.Наименование = "ОсновнаяФР" Тогда
                    ЕстьОсновнаяФР = Истина;
                КонецЕсли;
            КонецПопытки;
            
            Если Не ЕстьОсновнаяФР Тогда
                ВызватьИсключение "При отсутствии массива ""Команды"" в массиве ""Карточки"" должна присутствовать только одна функциональная роль ""ОсновнаяФР"".";
            КонецЕсли;
        Иначе
            ВызватьИсключение "При отсутствии массива ""Команды"" в массиве ""Карточки"" должна присутствовать только одна функциональная роль ""ОсновнаяФР"".";
        КонецЕсли;
    КонецЕсли;
    
    // 3. Подготовка Таблицы Значений для передачи карточек в запрос
    тзКарточки = Новый ТаблицаЗначений;
    тзКарточки.Колонки.Добавить("ФункциональнаяРоль", Новый ОписаниеТипов("СправочникСсылка._ФункциональныеРоли"));
    тзКарточки.Колонки.Добавить("Карточка", Новый ОписаниеТипов("СправочникСсылка._Карточки"));
    тзКарточки.Колонки.Добавить("ПроверятьКакИ", Новый ОписаниеТипов("Булево"));

    Для Каждого ГруппаРолей Из Отбор.Карточки Цикл
        Для Каждого Карточка Из ГруппаРолей.Карточки Цикл
            СтрокаТЗ = тзКарточки.Добавить();
            СтрокаТЗ.ФункциональнаяРоль = ГруппаРолей.ФункциональнаяРоль;
            СтрокаТЗ.Карточка = Карточка;
            СтрокаТЗ.ПроверятьКакИ = ГруппаРолей.ПроверятьКакИ;
        КонецЦикла;
    КонецЦикла;
    
    // 4. Подготовка запроса и его выполнение
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    
    Запрос.УстановитьПараметр("МассивКарточек", тзКарточки);
    
    Если ЕстьВидКарточки Тогда
        Запрос.УстановитьПараметр("ВидКарточки", Отбор.ВидКарточки);
    Иначе
        Запрос.УстановитьПараметр("ВидКарточки", Справочники._ВидыКарточек.ПустаяСсылка());
    КонецЕсли;
    
    Если ЕстьКоманды Тогда
        Запрос.УстановитьПараметр("МассивКоманд", Отбор.Команды);
        Запрос.УстановитьПараметр("МассивКомандПуст", Ложь);
    Иначе
        Запрос.УстановитьПараметр("МассивКоманд", Новый Массив); 
        Запрос.УстановитьПараметр("МассивКомандПуст", Истина);
    КонецЕсли;
    
    Запрос.Текст =
        "
        // ЭТАП 1: Получаю Виды реквизитов, значения котрых требуется анализировать для поиска правил вида карточки
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |    _ПравилаУсловия.ВидРеквизита КАК ВидРеквизита,
        |    _ПравилаУсловия.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
        |ПОМЕСТИТЬ ВТ_Реквизиты
        |ИЗ
        |    Справочник._Правила.ВидыКарточек КАК _ПравилаВидыКарточек
        |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._Правила.Условия КАК _ПравилаУсловия
        |        ПО (_ПравилаВидыКарточек.Ссылка = _ПравилаУсловия.Ссылка
		|            И (&ВидКарточки = ЗНАЧЕНИЕ(Справочник._ВидыКарточек.ПустаяСсылка) ИЛИ _ПравилаВидыКарточек.ВидКарточки = &ВидКарточки))
        |ГДЕ
        |    (&ВидКарточки = ЗНАЧЕНИЕ(Справочник._ВидыКарточек.ПустаяСсылка) ИЛИ _ПравилаВидыКарточек.ВидКарточки = &ВидКарточки)
        |    И (_ПравилаУсловия.Ссылка.Команда В (&МассивКоманд) ИЛИ &МассивКомандПуст)
        |;
        |
        // ЭТАП 2: Проверяемые карточки (теперь берутся из переданной таблицы значений)
        |ВЫБРАТЬ
        |    КарточкиПараметр.Карточка КАК Карточка,
        |    КарточкиПараметр.ФункциональнаяРоль КАК ФункциональнаяРоль,
        |    КарточкиПараметр.ПроверятьКакИ КАК ПроверятьКакИ
        |ПОМЕСТИТЬ ВТ_Карточки
        |ИЗ
        |    &МассивКарточек КАК КарточкиПараметр
        |;
        |
		// ЭТАП 3: Умножаю реквизиты на отобранные карточки, что бы был NULL, если значение реквизита не хранится. Это необходимо, что бы проверка каждого реквизита гарантированно случилась.
        |ВЫБРАТЬ
        |    ВТ_Карточки.Карточка КАК Карточка,
        |    ВТ_Карточки.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: добавлено поле
        |    ВТ_Карточки.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: добавлено поле
        |    ВТ_Реквизиты.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_Реквизиты.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
        |ПОМЕСТИТЬ ВТ_КарточкиРеквизиты
        |ИЗ
        |    ВТ_Карточки КАК ВТ_Карточки
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реквизиты КАК ВТ_Реквизиты
        |        ПО (ИСТИНА)
        |;
        |
        // ЭТАП 4.1: Получаю значения реквизитов карточек для последующей проверки.
        |ВЫБРАТЬ
        |    ВТ_КарточкиРеквизиты.Карточка КАК Карточка,
        |    ВТ_КарточкиРеквизиты.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: пронесено поле
        |    ВТ_КарточкиРеквизиты.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: пронесено поле
        |    ВТ_КарточкиРеквизиты.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_КарточкиРеквизиты.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    Регистр.ЗначениеРеквизита КАК СвязаннаяКарточка,
        |    ВЫБОР КОГДА ВТ_КарточкиРеквизиты.ВидРеквизитаДополнение = ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка) ТОГДА Регистр.ЗначениеРеквизита ИНАЧЕ NULL КОНЕЦ КАК ЗначениеРеквизита,
        |    Регистр.УИД_Элемента КАК УИД_Элемента
        |ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек_1
        |ИЗ
        |	ВТ_КарточкиРеквизиты КАК ВТ_КарточкиРеквизиты
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СостояниеКарточек.СрезПоследних(
        |			,
        |			(Карточка В (ВЫБРАТЬ Карточка ИЗ ВТ_Карточки) И ВидРеквизита В (ВЫБРАТЬ РАЗЛИЧНЫЕ ВидРеквизита ИЗ ВТ_Реквизиты))
 		// Можно оптимизировать добавив отбор по виду реквизита на основании таблицы ВТ_Реквизиты
       |        ) КАК Регистр
        |        ПО ВТ_КарточкиРеквизиты.Карточка = Регистр.Карточка
        |         И ВТ_КарточкиРеквизиты.ВидРеквизита = Регистр.ВидРеквизита
        |ГДЕ
        |    Регистр.ЗначениеАктивно = ИСТИНА ИЛИ Регистр.ЗначениеАктивно ЕСТЬ NULL
        |;
        |
        // ЭТАП 4.2: Получаю значения реквизитов связанных карточек.
        |ВЫБРАТЬ
        |    ВТ_ЗначенияРеквизитовКарточек_1.Карточка КАК Карточка,
        |    ВТ_ЗначенияРеквизитовКарточек_1.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_1.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    ВТ_ЗначенияРеквизитовКарточек_1.УИД_Элемента КАК УИД_Элемента,
        |    Регистр.УИД_Элемента КАК УИД_ЭлементаДополнение,
        |    Регистр.ЗначениеРеквизита КАК ЗначениеРеквизита
        |ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек_2
        |ИЗ
        |	ВТ_ЗначенияРеквизитовКарточек_1 КАК ВТ_ЗначенияРеквизитовКарточек_1
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СостояниеКарточек.СрезПоследних(
        |			,
        |			(Карточка В (ВЫБРАТЬ РАЗЛИЧНЫЕ СвязаннаяКарточка ИЗ ВТ_ЗначенияРеквизитовКарточек_1) И ВидРеквизита В (ВЫБРАТЬ РАЗЛИЧНЫЕ ВидРеквизитаДополнение ИЗ ВТ_Реквизиты))
		// Можно оптимизировать добавив отбор по виду реквизита на основании таблицы ВТ_Реквизиты
        |        ) КАК Регистр
        |        ПО ВТ_ЗначенияРеквизитовКарточек_1.СвязаннаяКарточка = Регистр.Карточка
        |         И ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение = Регистр.ВидРеквизита
        |ГДЕ
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение <> ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
        |    И (Регистр.ЗначениеАктивно = ИСТИНА ИЛИ Регистр.ЗначениеАктивно ЕСТЬ NULL)
        |;
        |
        // ЭТАП 4.3: Объединяю таблицы значений реквизитов карточки и значений реквизитов связанных карточек
        |ВЫБРАТЬ
        |    ВТ_ЗначенияРеквизитовКарточек_1.Карточка КАК Карточка,
        |    ВТ_ЗначенияРеквизитовКарточек_1.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_1.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    ВТ_ЗначенияРеквизитовКарточек_1.УИД_Элемента КАК УИД_Элемента,
        |    NULL КАК УИД_ЭлементаДополнение,
        |    ВТ_ЗначенияРеквизитовКарточек_1.ЗначениеРеквизита КАК ЗначениеРеквизита
        |ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек
        |ИЗ
        |    ВТ_ЗначенияРеквизитовКарточек_1 КАК ВТ_ЗначенияРеквизитовКарточек_1
        |ГДЕ
        |    ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение = ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
        |ОБЪЕДИНИТЬ ВСЕ
        |ВЫБРАТЬ
        |    ВТ_ЗначенияРеквизитовКарточек_2.Карточка КАК Карточка,
        |    ВТ_ЗначенияРеквизитовКарточек_2.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_2.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    ВТ_ЗначенияРеквизитовКарточек_2.УИД_Элемента КАК УИД_Элемента,
        |    ВТ_ЗначенияРеквизитовКарточек_2.УИД_ЭлементаДополнение КАК УИД_ЭлементаДополнение,
        |    ВТ_ЗначенияРеквизитовКарточек_2.ЗначениеРеквизита КАК ЗначениеРеквизита
        |ИЗ
        |    ВТ_ЗначенияРеквизитовКарточек_2 КАК ВТ_ЗначенияРеквизитовКарточек_2
        |ГДЕ
        |    ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизитаДополнение <> ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
        |;
        |
        // ЭТАП 5: Подготавливаю атомарные условия
		// Требуется оптимизация, попадают условия из лишних правил
		// Вариант 1 использовать Видам реквизитов из ВТ_Реквизиты и Функциональным ролям из отбора
		// Вариант 2 использовать использовать фильтр к Правилам на основании ВидаКарточки
		// Также добавить фильтр по Функциональным ролям из отбора
        |ВЫБРАТЬ
        |    _ПравилаУсловия.Ссылка КАК Правило,
        |    _ПравилаУсловия.НомерСтроки КАК НомерСтроки,
        |    _ПравилаУсловия.Группа КАК Группа,
        |    _ПравилаУсловия.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: добавлено поле
        |    _ПравилаУсловия.ВидРеквизита КАК ВидРеквизита,
        |    _ПравилаУсловия.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    1 КАК Чек,
        |    _ПравилаУсловия.Сравнение_1 КАК Сравнение,
        |    _ПравилаУсловия.ЗначениеРеквизита_1 КАК ЗначениеРеквизита
        |ПОМЕСТИТЬ ВТ_ЗначенияУсловий
        |ИЗ
        |    Справочник._Правила.Условия КАК _ПравилаУсловия
        |ГДЕ
        |    (_ПравилаУсловия.Ссылка.Команда В (&МассивКоманд) ИЛИ &МассивКомандПуст) // <<< ИЗМ: отбор по массиву команд
        |    И _ПравилаУсловия.Сравнение_1 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать)
        |ОБЪЕДИНИТЬ ВСЕ
        |ВЫБРАТЬ
        |    _ПравилаУсловия.Ссылка,
        |    _ПравилаУсловия.НомерСтроки,
        |    _ПравилаУсловия.Группа,
        |    _ПравилаУсловия.ФункциональнаяРоль, // <<< ИЗМ: добавлено поле
        |    _ПравилаУсловия.ВидРеквизита,
        |    _ПравилаУсловия.ВидРеквизитаДополнение,
        |    2,
        |    _ПравилаУсловия.Сравнение_2,
        |    _ПравилаУсловия.ЗначениеРеквизита_2
        |ИЗ
        |    Справочник._Правила.Условия КАК _ПравилаУсловия
        |ГДЕ
        |    (_ПравилаУсловия.Ссылка.Команда В (&МассивКоманд) ИЛИ &МассивКомандПуст) // <<< ИЗМ: отбор по массиву команд
        |    И _ПравилаУсловия.Сравнение_2 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать)
        |    И _ПравилаУсловия.Сравнение_2 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.ПустаяСсылка)
        |;
        |
        // ЭТАП 6: Подготавливаю данные для атомарных условий.
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |    ВТ_ЗначенияРеквизитовКарточек.Карточка КАК Карточка,
        |    ВТ_ЗначенияРеквизитовКарточек.ФункциональнаяРоль КАК ФункциональнаяРоль, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек.ПроверятьКакИ КАК ПроверятьКакИ, // <<< ИЗМ: пронесено поле
        |    ВТ_ЗначенияРеквизитовКарточек.ЗначениеРеквизита КАК ЗначениеКарточки,
        |    ВТ_ЗначенияУсловий.ЗначениеРеквизита КАК ЗначениеПроверки,
        |    ВТ_ЗначенияУсловий.Сравнение КАК Сравнение,
        |    ВТ_ЗначенияУсловий.Правило КАК Правило,
        |    ВТ_ЗначенияУсловий.Группа КАК Группа,
        |    ВТ_ЗначенияУсловий.ВидРеквизита КАК ВидРеквизита,
        |    ВТ_ЗначенияУсловий.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
        |    ВТ_ЗначенияУсловий.НомерСтроки КАК НомерСтроки,
        |    ВТ_ЗначенияУсловий.Чек КАК Чек,
        |    ВТ_ЗначенияРеквизитовКарточек.УИД_Элемента КАК УИД_Элемента,
        |    ВТ_ЗначенияРеквизитовКарточек.УИД_ЭлементаДополнение КАК УИД_ЭлементаДополнение
        |ПОМЕСТИТЬ ВТ_ПроверяемыеСеты
        |ИЗ
        |    ВТ_ЗначенияРеквизитовКарточек КАК ВТ_ЗначенияРеквизитовКарточек
        |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияУсловий КАК ВТ_ЗначенияУсловий
        |        ПО ВТ_ЗначенияРеквизитовКарточек.ВидРеквизита = ВТ_ЗначенияУсловий.ВидРеквизита
        |        И ВТ_ЗначенияРеквизитовКарточек.ВидРеквизитаДополнение = ВТ_ЗначенияУсловий.ВидРеквизитаДополнение
        |        И ВТ_ЗначенияРеквизитовКарточек.ФункциональнаяРоль = ВТ_ЗначенияУсловий.ФункциональнаяРоль // <<< ИЗМ: связь по функциональной роли
        |;
        |
        // ЭТАП 7: Вычисляем результат каждой атомарной проверки (1 = Истина, 0 = Ложь)
        |ВЫБРАТЬ
        |    Карточка, ФункциональнаяРоль, ПроверятьКакИ, ЗначениеКарточки, ЗначениеПроверки, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_Элемента, УИД_ЭлементаДополнение,
        |    ВЫБОР
        |        КОГДА(Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Равно) И ЗначениеКарточки = ЗначениеПроверки) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Больше) И ЗначениеКарточки > ЗначениеПроверки) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Меньше) И ЗначениеКарточки < ЗначениеПроверки) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.БольшеРавно) И ЗначениеКарточки >= ЗначениеПроверки) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.МеньшеРавно) И ЗначениеКарточки <= ЗначениеПроверки) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Заполнено) И (НЕ ЗначениеКарточки ЕСТЬ NULL И ЗначениеКарточки <> Неопределено)) ИЛИ
        |             (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеЗаполнено) И (ЗначениеКарточки ЕСТЬ NULL ИЛИ ЗначениеКарточки = Неопределено)) ИЛИ
        |             Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.ПустаяСсылка) ИЛИ
        |             Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать)
        |        ТОГДА 1 ИНАЧЕ 0
        |    КОНЕЦ КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверок
        |ИЗ
        |    ВТ_ПроверяемыеСеты
        |;
        |
		// ЭТАП 7.1 Уровень Функциональной Роли:
        // схлопываем Карточки. ИСТИНА = должны пройти ВСЕ карточки (МИНИМУМ), ЛОЖЬ = достаточно ЛЮБОЙ (МАКСИМУМ).
        |ВЫБРАТЬ
        |    Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_ЭлементаДополнение,
        |    ВЫБОР КОГДА МИНИМУМ(ВЫБОР КОГДА ПроверятьКакИ = ИСТИНА ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) = 1 
        |        ТОГДА МИНИМУМ(РезультатПроверки) 
        |        ИНАЧЕ МАКСИМУМ(РезультатПроверки) 
        |    КОНЕЦ КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверокКарточек
        |ИЗ
        |    ВТ_РезультатыПроверок
        |СГРУППИРОВАТЬ ПО Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_ЭлементаДополнение
        |;
        |
        // ЭТАП 7.2 (множественные реквизиты СВЯЗАННЫХ карточек):
        // схлопываем элементы УИД_ЭлементаДополнение (оставляем МАКСИМУМ, так как параметр множественности убран)
        |ВЫБРАТЬ
        |    Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек,
        |    МАКСИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверокЭлементовСвязанных
        |ИЗ
        |    ВТ_РезультатыПроверокКарточек
        |СГРУППИРОВАТЬ ПО Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек
        |;
        |
        // ЭТАП 8: (Уровень строки: И) Вычисляю результат проверки строк.
		// Строка считается выполненной, если все чеки для неё выполнены (МИНИМУМ = 1).
        |ВЫБРАТЬ
        |    Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки,
        |    МИНИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверкиСтрок
        |ИЗ
        |    ВТ_РезультатыПроверокЭлементовСвязанных
        |СГРУППИРОВАТЬ ПО Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки
        |;
        |
        // ЭТАП 9 (Уровень вида реквизита: ИЛИ): Вычисляю результат проверки реквизитов.
		// Реквизит считается выполненным, если для него имеется хотя бы одна выполненная строка (МАКСИМУМ = 1).
        |ВЫБРАТЬ
        |    Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение,
        |    МАКСИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверкиРеквизитов
        |ИЗ
        |    ВТ_РезультатыПроверкиСтрок
        |СГРУППИРОВАТЬ ПО Правило, Группа, ФункциональнаяРоль, ВидРеквизита, ВидРеквизитаДополнение
        |;
        |
        // ЭТАП 9.5 Уровень функциональной роли: И):
        // Функциональные роли между собой в рамках группы объединяются по "И".
        |ВЫБРАТЬ
        |    Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение,
        |    МИНИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверкиРолей
        |ИЗ
        |    ВТ_РезультатыПроверкиРеквизитов
        |СГРУППИРОВАТЬ ПО Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение
        |;
        |
		// ЭТАП 10 (Уровень группы: И): Вычисляю результат проверки группы.
		// Группа считается выполненной, если все её реквизиты выполнены (МИНИМУМ = 1).
        |ВЫБРАТЬ
        |    Правило, Группа,
        |    МИНИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверкиГрупп
        |ИЗ
        |    ВТ_РезультатыПроверкиРолей 
        |СГРУППИРОВАТЬ ПО Правило, Группа
        |;
        |
 		// ЭТАП 11 (Уровень правила: ИЛИ между группами): Вычисляю результат проверки правила.
		// Правило считается выполненным, если выполнена хотя бы одна группа (МАКСИМУМ = 1).
       |ВЫБРАТЬ
        |    Правило,
        |    МАКСИМУМ(РезультатПроверки) КАК РезультатПроверки
        |ПОМЕСТИТЬ ВТ_РезультатыПроверкиПравил
        |ИЗ
        |    ВТ_РезультатыПроверкиГрупп
        |СГРУППИРОВАТЬ ПО Правило
        |;
        |
        // ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |    Правило КАК Правило // <<< ИЗМ: поле Карточка удалено
        |ПОМЕСТИТЬ ВТ_ВыполненыеПравила
        |ИЗ
        |    ВТ_РезультатыПроверкиПравил
        |ГДЕ РезультатПроверки = 1
        |;
        |
        // ЭТАП 13: Финальная выборка доступных правил и их команд.
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |    Правило КАК Правило,
        |    Правило.Команда КАК Команда,
        |    Правило.Команда.Группа КАК ГруппаКоманд
        |ПОМЕСТИТЬ ВТ_ДоступныеПравила
        |ИЗ
        |    ВТ_ВыполненыеПравила";
        
    Запрос.Выполнить();
    
КонецПроцедуры

Процедура СтараяПроцедура_УДАЛИТЬ_СформироватьМВТ_ДоступныеПравила(Отбор, МенеджерВременныхТаблиц)	
	// 1. Подготовка Менеджера Временных Таблиц
	//Если Не ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
	//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//КонецЕсли;

	
	//2.
	// Вызов функции ПолучитьСостояние, которая создаст ВТ_Реквизиты и ВТ_ЗначенияРеквизитов МенеджерВременныхТаблиц
	//РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(, Отбор, МенеджерВременныхТаблиц);
	
	//3. Подготовка запроса и его выполнение
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	//+Временный код
	// Получение состояния карточек желательно сделать с помощью РегистрыСведений._СостояниеКарточек.ПолучитьСостояние()
	
	// Проверка обязательного параметра, нужно настроить возможность проверки массива карточек
	Если ЗначениеЗаполнено(Отбор.Карточка) Тогда
	Иначе
		ВызватьИсключение "Параметр ""Отбор"" должен содержать заполненное свойство ""Карточка"".";
	КонецЕсли;
	// заполняю параметр МассивКарточек
	МассивКарточекДляЗапроса = Новый Массив();
	МассивКарточекДляЗапроса.Добавить(Отбор.Карточка);
	Запрос.УстановитьПараметр("МассивКарточек", МассивКарточекДляЗапроса);

	// вычисление значения параметра ВидаКарточки. Важно: исхожу из положения,одно значение. слодовательно все карточки должны быть одного вида
	Запрос.УстановитьПараметр("ВидКарточки", Отбор.Карточка.ВидКарточки);

	// определение параметра проверки множественных реквизитов (по умолчанию Ложь = поведение как раньше)
	Запрос.УстановитьПараметр("ОбрабатыватьМножественныеРеквизитыКакИ", Ложь);

	//-Временный код
	
	Запрос.Текст =
		"
		// ЭТАП 1: Получаю Виды реквизитов, значения котрых требуется анализировать для поиска правил вида карточки
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ПравилаУсловия.ВидРеквизита КАК ВидРеквизита,
		|	_ПравилаУсловия.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
		|ПОМЕСТИТЬ ВТ_Реквизиты
		|ИЗ
		|	Справочник._Правила.ВидыКарточек КАК _ПравилаВидыКарточек
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник._Правила.Условия КАК _ПравилаУсловия
		|		ПО (_ПравилаВидыКарточек.ВидКарточки = &ВидКарточки
		|			И _ПравилаВидыКарточек.Ссылка = _ПравилаУсловия.Ссылка)
		|ГДЕ
		|	_ПравилаВидыКарточек.ВидКарточки = &ВидКарточки
		|;
		|
		// ЭТАП 2: Проверяемые карточки
		|ВЫБРАТЬ
		|	_Карточки.Ссылка КАК Карточка
		|ПОМЕСТИТЬ ВТ_Карточки
		|ИЗ
		|	Справочник._Карточки КАК _Карточки
		|ГДЕ
		|	_Карточки.Ссылка В(&МассивКарточек)
		|;
		|
		// ЭТАП 3: Умножаю реквизиты на отобранные карточки, что бы был NULL, если значение реквизита не указано. Это необходимо, что бы проверка каждого реквизита гарантированно случилась.
		|ВЫБРАТЬ
		|	ВТ_Карточки.Карточка КАК Карточка,
		|	ВТ_Реквизиты.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_Реквизиты.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
		|ПОМЕСТИТЬ ВТ_КарточкиРеквизиты
		|ИЗ
		|	ВТ_Карточки КАК ВТ_Карточки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реквизиты КАК ВТ_Реквизиты
		|		ПО (ИСТИНА)
		|;
		|
		// ЭТАП 4.1: Получаю значения реквизитов карточек для последующей проверки.
		|ВЫБРАТЬ
		|	ВТ_КарточкиРеквизиты.Карточка КАК Карточка,
		|	ВТ_КарточкиРеквизиты.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_КарточкиРеквизиты.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	Регистр.ЗначениеРеквизита КАК СвязаннаяКарточка,
		|	ВЫБОР КОГДА ВТ_КарточкиРеквизиты.ВидРеквизитаДополнение = ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка) ТОГДА Регистр.ЗначениеРеквизита ИНАЧЕ NULL КОНЕЦ КАК ЗначениеРеквизита,
		|	Регистр.УИД_Элемента КАК УИД_Элемента // <<<ИЗМ>>> добавлено поле УИД_Элемента из регистра
		|ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек_1
		|ИЗ
		|	ВТ_КарточкиРеквизиты КАК ВТ_КарточкиРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СостояниеКарточек.СрезПоследних(
		|				,
		|				Карточка В (ВЫБРАТЬ Карточка ИЗ ВТ_Карточки)
		// Можно оптимизировать добавив отбор по виду реквизита на основании таблицы ВТ_Реквизиты
		|		) КАК Регистр
		|		ПО ВТ_КарточкиРеквизиты.Карточка = Регистр.Карточка
		|		 И ВТ_КарточкиРеквизиты.ВидРеквизита = Регистр.ВидРеквизита
		|ГДЕ // <<<ИЗМ>>> новый ГДЕ: учитываем только активные элементы; ЕСТЬ NULL сохраняет строку, когда значения в регистре нет вовсе (прежняя логика ЭТАПА 3)
		|	Регистр.ЗначениеАктивно = ИСТИНА ИЛИ Регистр.ЗначениеАктивно ЕСТЬ NULL // <<<ИЗМ>>>
		|;
		|
		// ЭТАП 4.2: Получаю значения реквизитов связанных карточек.
		|ВЫБРАТЬ
		|	ВТ_ЗначенияРеквизитовКарточек_1.Карточка КАК Карточка,
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	ВТ_ЗначенияРеквизитовКарточек_1.УИД_Элемента КАК УИД_Элемента, // <<<ИЗМ>>> пронесён УИД элемента текущей карточки (в т.ч. множественной ссылки)
		|	Регистр.УИД_Элемента КАК УИД_ЭлементаДополнение, // <<<ИЗМ>>> добавлено поле УИД_ЭлементаДополнение из регистра связанной карточки
		|	Регистр.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек_2
		|ИЗ
		|	ВТ_ЗначенияРеквизитовКарточек_1 КАК ВТ_ЗначенияРеквизитовКарточек_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СостояниеКарточек.СрезПоследних(
		|				,
		|				Карточка В (ВЫБРАТЬ РАЗЛИЧНЫЕ СвязаннаяКарточка ИЗ ВТ_ЗначенияРеквизитовКарточек_1)
		// Можно оптимизировать добавив отбор по виду реквизита на основании таблицы ВТ_Реквизиты
		|		) КАК Регистр
		|		ПО ВТ_ЗначенияРеквизитовКарточек_1.СвязаннаяКарточка = Регистр.Карточка
		|		 И ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение = Регистр.ВидРеквизита // Регистр.ВидРеквизита - обязателен к заполнению, поэтому для пустых ВидРеквизитаДополнение не появится
		|ГДЕ
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение <> ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
		|	И (Регистр.ЗначениеАктивно = ИСТИНА ИЛИ Регистр.ЗначениеАктивно ЕСТЬ NULL) // <<<ИЗМ>>> только активные элементы связанной карточки, NULL сохраняет прежнюю логику
		|;
		|
		// ЭТАП 4.3: Объединяю таблицы значений реквизитов карточки и значений реквизитов связанных карточек
		|ВЫБРАТЬ
		|	ВТ_ЗначенияРеквизитовКарточек_1.Карточка КАК Карточка,
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	ВТ_ЗначенияРеквизитовКарточек_1.УИД_Элемента КАК УИД_Элемента, // <<<ИЗМ>>> поле УИД_Элемента в итоговой таблице
		|	NULL КАК УИД_ЭлементаДополнение, // <<<ИЗМ>>> для собственных реквизитов текущей карточки дополнения нет
		|	ВТ_ЗначенияРеквизитовКарточек_1.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек
		|ИЗ
		|	ВТ_ЗначенияРеквизитовКарточек_1 КАК ВТ_ЗначенияРеквизитовКарточек_1
		|ГДЕ
		|	ВТ_ЗначенияРеквизитовКарточек_1.ВидРеквизитаДополнение = ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ВТ_ЗначенияРеквизитовКарточек_2.Карточка КАК Карточка,
		|	ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	ВТ_ЗначенияРеквизитовКарточек_2.УИД_Элемента КАК УИД_Элемента, // <<<ИЗМ>>> поле УИД_Элемента в итоговой таблице
		|	ВТ_ЗначенияРеквизитовКарточек_2.УИД_ЭлементаДополнение КАК УИД_ЭлементаДополнение, // <<<ИЗМ>>> поле УИД_ЭлементаДополнение в итоговой таблице
		|	ВТ_ЗначенияРеквизитовКарточек_2.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	ВТ_ЗначенияРеквизитовКарточек_2 КАК ВТ_ЗначенияРеквизитовКарточек_2
		|ГДЕ
		// Проверка на ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка уже сделана на этапе 4.2, но пусть будет здесь для читаемости кода
		|	ВТ_ЗначенияРеквизитовКарточек_2.ВидРеквизитаДополнение <> ЗНАЧЕНИЕ(ПланВидовХарактеристик._ВидыРеквизитов.ПустаяСсылка)
		|;
		|
		// ЭТАП 5: Подготавливаю атомарные условия, для каждой строки условия должна быть ИСТИНА и для срвнения_1 и для Сравнения_2.
		|ВЫБРАТЬ
		|	_ПравилаУсловия.Ссылка КАК Правило,
		|	_ПравилаУсловия.НомерСтроки КАК НомерСтроки,
		|	_ПравилаУсловия.Группа КАК Группа,
		|	_ПравилаУсловия.ВидРеквизита КАК ВидРеквизита,
		|	_ПравилаУсловия.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	1 КАК Чек,
		|	_ПравилаУсловия.Сравнение_1 КАК Сравнение,
		|	_ПравилаУсловия.ЗначениеРеквизита_1 КАК ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ЗначенияУсловий
		|ИЗ
		|	Справочник._Правила.Условия КАК _ПравилаУсловия
		|ГДЕ
		|	_ПравилаУсловия.Ссылка.Команда = &Команда
		|	И _ПравилаУсловия.Сравнение_1 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	_ПравилаУсловия.Ссылка,
		|	_ПравилаУсловия.НомерСтроки,
		|	_ПравилаУсловия.Группа,
		|	_ПравилаУсловия.ВидРеквизита,
		|	_ПравилаУсловия.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	2,
		|	_ПравилаУсловия.Сравнение_2,
		|	_ПравилаУсловия.ЗначениеРеквизита_2
		|ИЗ
		|	Справочник._Правила.Условия КАК _ПравилаУсловия
		|ГДЕ
		|	_ПравилаУсловия.Ссылка.Команда = &Команда
		|	И _ПравилаУсловия.Сравнение_2 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать)
		|	И _ПравилаУсловия.Сравнение_2 <> ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.ПустаяСсылка)
		|;
		|
		// ЭТАП 6: Подготавливаю данные для атомарных условий.
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ЗначенияРеквизитовКарточек.Карточка КАК Карточка,
		|	ВТ_ЗначенияРеквизитовКарточек.ЗначениеРеквизита КАК ЗначениеКарточки,
		|	ВТ_ЗначенияУсловий.ЗначениеРеквизита КАК ЗначениеПроверки,
		|	ВТ_ЗначенияУсловий.Сравнение КАК Сравнение,
		|	ВТ_ЗначенияУсловий.Правило КАК Правило,
		|	ВТ_ЗначенияУсловий.Группа КАК Группа,
		|	ВТ_ЗначенияУсловий.ВидРеквизита КАК ВидРеквизита,
		|	ВТ_ЗначенияУсловий.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение,
		|	ВТ_ЗначенияУсловий.НомерСтроки КАК НомерСтроки,
		|	ВТ_ЗначенияУсловий.Чек КАК Чек,
		|	ВТ_ЗначенияРеквизитовКарточек.УИД_Элемента КАК УИД_Элемента, // <<<ИЗМ>>> пронесён УИД элемента
		|	ВТ_ЗначенияРеквизитовКарточек.УИД_ЭлементаДополнение КАК УИД_ЭлементаДополнение // <<<ИЗМ>>> пронесён УИД элемента дополнения
		|ПОМЕСТИТЬ ВТ_ПроверяемыеСеты
		|ИЗ
		|	ВТ_ЗначенияРеквизитовКарточек КАК ВТ_ЗначенияРеквизитовКарточек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияУсловий КАК ВТ_ЗначенияУсловий
		|		ПО ВТ_ЗначенияРеквизитовКарточек.ВидРеквизита = ВТ_ЗначенияУсловий.ВидРеквизита
		|		И ВТ_ЗначенияРеквизитовКарточек.ВидРеквизитаДополнение = ВТ_ЗначенияУсловий.ВидРеквизитаДополнение
		|;
		|
		// ЭТАП 7: Вычисляем результат каждой атомарной проверки (1 = Истина, 0 = Ложь)
		|ВЫБРАТЬ
		|	Карточка, ЗначениеКарточки, ЗначениеПроверки, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_Элемента, УИД_ЭлементаДополнение, // <<<ИЗМ>>> в список полей добавлены УИД_Элемента, УИД_ЭлементаДополнение
		|	ВЫБОР
		|		КОГДА(Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Равно) И ЗначениеКарточки = ЗначениеПроверки) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Больше) И ЗначениеКарточки > ЗначениеПроверки) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Меньше) И ЗначениеКарточки < ЗначениеПроверки) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.БольшеРавно) И ЗначениеКарточки >= ЗначениеПроверки) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.МеньшеРавно) И ЗначениеКарточки <= ЗначениеПроверки) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.Заполнено) И (НЕ ЗначениеКарточки ЕСТЬ NULL И ЗначениеКарточки <> Неопределено)) ИЛИ
		|		     (Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеЗаполнено) И (ЗначениеКарточки ЕСТЬ NULL ИЛИ ЗначениеКарточки = Неопределено)) ИЛИ
		|			 Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.ПустаяСсылка) ИЛИ    // откличено на этапе 5, но всё равно пусть здесь будет эта проверка, что бы не потерялась
		|			 Сравнение = ЗНАЧЕНИЕ(Перечисление._ВариантыСравнения.НеИспользовать) // откличено на этапе 5, но всё равно пусть здесь будет эта проверка, что бы не потерялась
		|		ТОГДА 1 ИНАЧЕ 0
		|	КОНЕЦ КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверок
		|ИЗ
		|	ВТ_ПроверяемыеСеты
		|;
		|
		// <<<НОВЫЙ БЛОК>>> ЭТАП 7.1 (множественные реквизиты ТЕКУЩЕЙ карточки, включая множественную ссылку на связанную):
		// схлопываем элементы УИД_Элемента. ИСТИНА = должны пройти ВСЕ элементы (МИНИМУМ), ЛОЖЬ = достаточно ЛЮБОГО (МАКСИМУМ).
		|ВЫБРАТЬ
		|	Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_ЭлементаДополнение,
		|	ВЫБОР КОГДА &ОбрабатыватьМножественныеРеквизитыКакИ = ИСТИНА ТОГДА МИНИМУМ(РезультатПроверки) ИНАЧЕ МАКСИМУМ(РезультатПроверки) КОНЕЦ КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверокЭлементовТекущей
		|ИЗ
		|	ВТ_РезультатыПроверок
		|СГРУППИРОВАТЬ ПО Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек, УИД_ЭлементаДополнение
		|;
		|
		// ЭТАП 7.2 (множественные реквизиты СВЯЗАННЫХ карточек):
		// схлопываем элементы УИД_ЭлементаДополнение с той же логикой параметра. Проверка параметра выполнена выделено от этапа 7.1.
		|ВЫБРАТЬ
		|	Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек,
		|	ВЫБОР КОГДА &ОбрабатыватьМножественныеРеквизитыКакИ = ИСТИНА ТОГДА МИНИМУМ(РезультатПроверки) ИНАЧЕ МАКСИМУМ(РезультатПроверки) КОНЕЦ КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверокЭлементовСвязанных
		|ИЗ
		|	ВТ_РезультатыПроверокЭлементовТекущей
		|СГРУППИРОВАТЬ ПО Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки, Чек
		|;
		// <<<КОНЕЦ НОВОГО БЛОКА>>>
		|
		// ЭТАП 8: (Уровень строки: И) Вычисляю результат проверки строк.
		// Строка считается выполненной, если все чеки для неё выполнены (МИНИМУМ = 1).
		// ЭТАП 9 (Уровень вида реквизита: ИЛИ): Вычисляю результат проверки реквизитов.
		// Реквизит считается выполненным, если для него имеется хотя бы одна выполненная строка (МАКСИМУМ = 1).
		// ЭТАП 10 (Уровень группы: И): Вычисляю результат проверки группы.
		// Группа считается выполненной, если все её реквизиты выполнены (МИНИМУМ = 1).
		// ЕСТЬNULL добавлен на случай пустой группы, чтобы она считалась невыполненной (0).
		// ЭТАП 11 (Уровень правила: ИЛИ между группами): Вычисляю результат проверки правила.
		// Правило считается выполненным, если выполнена хотя бы одна группа (МАКСИМУМ = 1).
		// ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ
		|	Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки,
		|	МИНИМУМ(РезультатПроверки) КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверкиСтрок
		|ИЗ
		|	ВТ_РезультатыПроверокЭлементовСвязанных // <<<ИЗМ>>> источник изменён с ВТ_РезультатыПроверок на ВТ_РезультатыПроверокЭлементовСвязанных
		|СГРУППИРОВАТЬ ПО Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение, НомерСтроки
		|;
		|
		// ЭТАП 9 (Уровень вида реквизита: ИЛИ): Вычисляю результат проверки реквизитов.
		// Реквизит считается выполненным, если для него имеется хотя бы одна выполненная строка (МАКСИМУМ = 1).
		// ЭТАП 10 (Уровень группы: И): Вычисляю результат проверки группы.
		// Группа считается выполненной, если все её реквизиты выполнены (МИНИМУМ = 1).
		// ЕСТЬNULL добавлен на случай пустой группы, чтобы она считалась невыполненной (0).
		// ЭТАП 11 (Уровень правила: ИЛИ между группами): Вычисляю результат проверки правила.
		// Правило считается выполненным, если выполнена хотя бы одна группа (МАКСИМУМ = 1).
		// ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ
		|	Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение,
		|	МАКСИМУМ(РезультатПроверки) КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверкиРеквизитов
		|ИЗ
		|	ВТ_РезультатыПроверкиСтрок
		|СГРУППИРОВАТЬ ПО Карточка, Правило, Группа, ВидРеквизита, ВидРеквизитаДополнение
		|;
		|
		// ЭТАП 10 (Уровень группы: И): Вычисляю результат проверки группы.
		// Группа считается выполненной, если все её реквизиты выполнены (МИНИМУМ = 1).
		// ЕСТЬNULL добавлен на случай пустой группы, чтобы она считалась невыполненной (0).
		// ЭТАП 11 (Уровень правила: ИЛИ между группами): Вычисляю результат проверки правила.
		// Правило считается выполненным, если выполнена хотя бы одна группа (МАКСИМУМ = 1).
		// ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ
		|	Карточка, Правило, Группа,
		|	ЕСТЬNULL(МИНИМУМ(РезультатПроверки), 0) КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверкиГрупп
		|ИЗ
		|	ВТ_РезультатыПроверкиРеквизитов
		|СГРУППИРОВАТЬ ПО Карточка, Правило, Группа
		|;
		|
		// ЭТАП 11 (Уровень правила: ИЛИ между группами): Вычисляю результат проверки правила.
		// Правило считается выполненным, если выполнена хотя бы одна группа (МАКСИМУМ = 1).
		// ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ
		|	Карточка, Правило,
		|	МАКСИМУМ(РезультатПроверки) КАК РезультатПроверки
		|ПОМЕСТИТЬ ВТ_РезультатыПроверкиПравил
		|ИЗ
		|	ВТ_РезультатыПроверкиГрупп
		|СГРУППИРОВАТЬ ПО Карточка, Правило
		|;
		|
		// ЭТАП 12: Отбираю доступные правила (те, где итоговый результат проверки = 1).
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Карточка КАК Карточка,
		|	Правило КАК Правило
		|ПОМЕСТИТЬ ВТ_ВыполненыеПравила_с_Карточками
		|ИЗ
		|	ВТ_РезультатыПроверкиПравил
		|ГДЕ РезультатПроверки = 1
		|;
		|
		// ЭТАП 13: Финальная выборка доступных правил и их команд.
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Правило КАК Правило,
		|	Правило.Команда КАК Команда,
		|	Правило.Команда.Группа КАК ГруппаКоманд
		|ПОМЕСТИТЬ ВТ_ДоступныеПравила
		|ИЗ
		|	ВТ_ВыполненыеПравила_с_Карточками
		|";

		
	Если Отбор.Свойство("Команда") И ЗначениеЗаполнено(Отбор.Команда) Тогда
		Запрос.УстановитьПараметр("Команда", Отбор.Команда);
	Иначе
		//отсутствует отбор для команды, удаляю эту проверку из текста запроса
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"_ПравилаУсловия.Ссылка.Команда = &Команда","ИСТИНА"); 
	КонецЕсли;
	
	// Выполнение запроса, которое и создаст все необходимые ВТ в менеджере.
	Запрос.Выполнить();

КонецПроцедуры
